# Introduccion a Pandas

In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame([[1,2,3,4],[3,4,5,6],["A", "B", "C", "D"]])
df

   0  1  2  3
0  1  2  3  4
1  3  4  5  6
2  A  B  C  D

In [6]:
fechas = pd.date_range("20230327", periods=7)
fechas

DatetimeIndex(['2023-03-27', '2023-03-28', '2023-03-29', '2023-03-30',
               '2023-03-31', '2023-04-01', '2023-04-02'],
              dtype='datetime64[ns]', freq='D')

In [8]:
matriz = np.random.normal(0, 1, (7,4))
matriz

array([[ 1.01885628, -1.23971287, -1.51023271, -0.26376313],
       [ 0.57996247, -0.52242902, -1.58894342,  0.47695838],
       [ 0.17121959,  0.49638929,  0.37078914, -0.76562765],
       [-0.69294349, -1.01222939,  0.75314401, -0.86807055],
       [-0.81513323,  0.646978  , -0.31767986,  1.19249188],
       [-1.05770953,  0.52183135,  0.50104639, -0.99595608],
       [ 0.77411658,  0.21694165, -1.17815115, -0.48030167]])

In [13]:
df1 = pd.DataFrame(matriz, index=fechas, columns=["Id", "nombre", "edad", "Genero"])
df1

                  Id    nombre      edad    Genero
2023-03-27  1.018856 -1.239713 -1.510233 -0.263763
2023-03-28  0.579962 -0.522429 -1.588943  0.476958
2023-03-29  0.171220  0.496389  0.370789 -0.765628
2023-03-30 -0.692943 -1.012229  0.753144 -0.868071
2023-03-31 -0.815133  0.646978 -0.317680  1.192492
2023-04-01 -1.057710  0.521831  0.501046 -0.995956
2023-04-02  0.774117  0.216942 -1.178151 -0.480302

In [27]:
[1,2,3]*3

[1, 2, 3, 1, 2, 3, 1, 2, 3]

In [26]:
dfb = pd.DataFrame(
    {
        "Identificador": [1,2,3,4,5],
        "Fecha": pd.Timestamp("20230329"),
        "numero": pd.Series(1, index=list(range(2,11,2))),
        "tipo": "Metalico",
        "arreglo": np.array([7]*5, dtype=np.int16)
    }
)
dfb

    Identificador      Fecha  numero      tipo  arreglo
2               1 2023-03-29       1  Metalico        7
4               2 2023-03-29       1  Metalico        7
6               3 2023-03-29       1  Metalico        7
8               4 2023-03-29       1  Metalico        7
10              5 2023-03-29       1  Metalico        7

In [28]:
dfb.dtypes

Identificador             int64
Fecha            datetime64[ns]
numero                    int64
tipo                     object
arreglo                   int16
dtype: object

In [29]:
dfb["Identificador"]

2     1
4     2
6     3
8     4
10    5
Name: Identificador, dtype: int64

In [30]:
dfb.Identificador

2     1
4     2
6     3
8     4
10    5
Name: Identificador, dtype: int64

In [31]:
dfb.tipo

2     Metalico
4     Metalico
6     Metalico
8     Metalico
10    Metalico
Name: tipo, dtype: object

In [32]:
dfb["tipo"]

2     Metalico
4     Metalico
6     Metalico
8     Metalico
10    Metalico
Name: tipo, dtype: object

In [33]:
df1

                  Id    nombre      edad    Genero
2023-03-27  1.018856 -1.239713 -1.510233 -0.263763
2023-03-28  0.579962 -0.522429 -1.588943  0.476958
2023-03-29  0.171220  0.496389  0.370789 -0.765628
2023-03-30 -0.692943 -1.012229  0.753144 -0.868071
2023-03-31 -0.815133  0.646978 -0.317680  1.192492
2023-04-01 -1.057710  0.521831  0.501046 -0.995956
2023-04-02  0.774117  0.216942 -1.178151 -0.480302

In [34]:
df1.index

DatetimeIndex(['2023-03-27', '2023-03-28', '2023-03-29', '2023-03-30',
               '2023-03-31', '2023-04-01', '2023-04-02'],
              dtype='datetime64[ns]', freq='D')

In [36]:
df1.columns

Index(['Id', 'nombre', 'edad', 'Genero'], dtype='object')

In [40]:
df1[1:4]

                  Id    nombre      edad    Genero
2023-03-28  0.579962 -0.522429 -1.588943  0.476958
2023-03-29  0.171220  0.496389  0.370789 -0.765628
2023-03-30 -0.692943 -1.012229  0.753144 -0.868071

In [39]:
df1["nombre"]

2023-03-27   -1.239713
2023-03-28   -0.522429
2023-03-29    0.496389
2023-03-30   -1.012229
2023-03-31    0.646978
2023-04-01    0.521831
2023-04-02    0.216942
Freq: D, Name: nombre, dtype: float64

In [49]:
df1.loc[fechas[1:4]]

                  Id    nombre      edad    Genero
2023-03-28  0.579962 -0.522429 -1.588943  0.476958
2023-03-29  0.171220  0.496389  0.370789 -0.765628
2023-03-30 -0.692943 -1.012229  0.753144 -0.868071

In [48]:
fechas

DatetimeIndex(['2023-03-27', '2023-03-28', '2023-03-29', '2023-03-30',
               '2023-03-31', '2023-04-01', '2023-04-02'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df1

                  Id    nombre      edad    Genero
2023-03-27  1.018856 -1.239713 -1.510233 -0.263763
2023-03-28  0.579962 -0.522429 -1.588943  0.476958
2023-03-29  0.171220  0.496389  0.370789 -0.765628
2023-03-30 -0.692943 -1.012229  0.753144 -0.868071
2023-03-31 -0.815133  0.646978 -0.317680  1.192492
2023-04-01 -1.057710  0.521831  0.501046 -0.995956
2023-04-02  0.774117  0.216942 -1.178151 -0.480302

In [52]:
df1.describe()

             Id    nombre      edad    Genero
count  7.000000  7.000000  7.000000  7.000000
mean  -0.003090 -0.127462 -0.424290 -0.243467
std    0.843237  0.785818  0.999176  0.802757
min   -1.057710 -1.239713 -1.588943 -0.995956
25%   -0.754038 -0.767329 -1.344192 -0.816849
50%    0.171220  0.216942 -0.317680 -0.480302
75%    0.677040  0.509110  0.435918  0.106598
max    1.018856  0.646978  0.753144  1.192492